modules/common/src/test/resources/com/l7tech/common/resources/egg/ValidBlueCardRequest.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" SOAP-ENV:mustUnderstand="1"><saml:Assertion xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" AssertionID="_c7055387-af61-4fce-8b98-e2927324b306" IssueInstant="2005-07-04T15:11:03Z" Issuer="http://www.egg.com" MajorVersion="1" MinorVersion="1"><saml:Conditions NotBefore="2005-07-04T15:11:03Z" NotOnOrAfter="2005-07-04T15:12:03Z"/><saml:AuthenticationStatement AuthenticationInstant="2005-07-04T15:11:03Z" AuthenticationMethod="urn:oasis:names:tc:SAML:1.0:am:password"><saml:Subject><saml:NameIdentifier Format="urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress" NameQualifier="http://www.egg.com">stuart@egg.com</saml:NameIdentifier><saml:SubjectConfirmation><saml:ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:sender-vouches</saml:ConfirmationMethod></saml:SubjectConfirmation></saml:Subject></saml:AuthenticationStatement><saml:AttributeStatement><saml:Subject><saml:NameIdentifier Format="urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress" NameQualifier="http://www.egg.com">stuart@egg.com</saml:NameIdentifier><saml:SubjectConfirmation><saml:ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:sender-vouches</saml:ConfirmationMethod></saml:SubjectConfirmation></saml:Subject><saml:Attribute AttributeName="ProductPortfolio" AttributeNamespace="http://www.egg.com/ns/attributes"><saml:AttributeValue><xyz:ProductPortfolio xmlns:xyz="http://www.egg.com/ns/products"><xyz:Product><xyz:Name>Red</xyz:Name><xyz:Type>CreditCard</xyz:Type><xyz:Activated>true</xyz:Activated></xyz:Product><xyz:Product><xyz:Name>Blue</xyz:Name><xyz:Type>CreditCard</xyz:Type><xyz:Activated>true</xyz:Activated></xyz:Product></xyz:ProductPortfolio></saml:AttributeValue></saml:Attribute><saml:Attribute AttributeName="CustomerRiskCategory" AttributeNamespace="http://www.egg.com/ns/attributes"><saml:AttributeValue>low</saml:AttributeValue></saml:Attribute></saml:AttributeStatement><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"/>
<ds:Reference URI="#_c7055387-af61-4fce-8b98-e2927324b306" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:Transforms xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"/>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="code ds kind rw saml samlp typens #default"/></ds:Transform>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"/>
<ds:DigestValue xmlns:ds="http://www.w3.org/2000/09/xmldsig#">pnzrvkaLW4Ppo822JYKDr1wvDjY=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
Zwx488xMFtCBvmG3MPFDFQmxeyLDM7CgeDZL7ui5z19JNYvDofV+0cguGuL3F/NMg2Q8HbBkU473
yudFDYIATymx8JJLodrqCGHsirfbR9DVFGCwbJK+xO1lh/xtT0MYb5Xa7v+H4SlcoI1p9Yu4R/Rt
p09bh3ftHJrDhyHGfFY=
</ds:SignatureValue>
<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:X509Data xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:X509Certificate xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
MIICBzCCAXACBEKLUn0wDQYJKoZIhvcNAQEEBQAwSzEKMAgGA1UEBhMBYzELMAkGA1UECBMCc3Qx
CjAIBgNVBAcTAWwxCjAIBgNVBAoTAW8xCzAJBgNVBAsTAm91MQswCQYDVQQDEwJjbjAeFw0wNTA1
MTgxNDM0MzdaFw0xNTA1MTYxNDM0MzdaMEsxCjAIBgNVBAYTAWMxCzAJBgNVBAgTAnN0MQowCAYD
VQQHEwFsMQowCAYDVQQKEwFvMQswCQYDVQQLEwJvdTELMAkGA1UEAxMCY24wgZ4wDQYJKoZIhvcN
AQEBBQADgYwAMIGIAoGAdIU3BrMaXPEtvzsn+Gg49kYFW3vRF9kP0ofsWJiBRaWb/QZDmwdMm6tw
PEfJ6tQifn+RpwPhlD3QVByfkq+eo3O5pwigUQCiY79PwuFomIBdtV8d4EUak024iFqChmlxz7+j
98GAQkS7Jd4qgK1yvfxA3bN57u76bvwfXqhYjzcCAwEAATANBgkqhkiG9w0BAQQFAAOBgQA69x5x
eEh26rR4H00JRMYQeHhryLBmVnn/0cmkAKglYoi/VJaVz00LU3ux34uUfnNyV9DoztsPbDJcF7DV
GKufvhZkhXGI8n+Toqilju9dHzNix4/B/lv5XQADxWth9lOvjA24J5CIkjLRx9HXra2pcC00sVRS
YwJcvZAO63MqDw==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo></ds:Signature></saml:Assertion></wsse:Security></SOAP-ENV:Header><SOAP-ENV:Body><ns1:getVersion xmlns:ns1="http://axis.apache.org" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></SOAP-ENV:Body></SOAP-ENV:Envelope>