94/38694/17729/WS-Test.jtl

<?xml version="1.0" encoding="UTF-8"?>
<testResults version="1.2">
<sample t="125" lt="0" ts="1140192085369" s="true" lb="Axis Version" rc="200" rm="" tn="Check ThreadGroup 1-1" dt="text">
  <responseData class="java.lang.String">Unsupported encoding in response data, can&apos;t record.</responseData>
  <samplerData class="java.lang.String">http://localhost//axis/services/Version
&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;
&lt;soapenv:Body&gt;
&lt;ns0:getVersion xmlns:ns0=&quot;http://axis.apache.org&quot; soapenv:encodingStyle=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot;/&gt;
&lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</samplerData>
</sample>
<httpSample t="62" lt="62" ts="1140192086070" s="true" lb="Soap/XML-RPC Sampler (Beta code)" rc="200" rm="OK" tn="SOAP/XML-Requests 2-1" dt="text">
  <responseData class="java.lang.String">&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;&lt;soapenv:Body&gt;&lt;ns1:getVersionResponse soapenv:encodingStyle=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot; xmlns:ns1=&quot;http://axis.apache.org&quot;&gt;&lt;getVersionReturn xsi:type=&quot;xsd:string&quot;&gt;Apache Axis version: 1.3
Built on Oct 05, 2005 (05:23:37 EDT)&lt;/getVersionReturn&gt;&lt;/ns1:getVersionResponse&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;</responseData>
  <cookies class="java.lang.String"></cookies>
  <method class="java.lang.String">POST</method>
  <queryString class="java.lang.String"></queryString>
  <url>http://localhost:7002/axis/services/Version</url>
</httpSample>

</testResults>
