94/38694/17746/WS-Test.jtl

<?xml version="1.0" encoding="UTF-8"?>
<testResults version="1.2">
<sample t="31" lt="0" ts="1140420905745" s="true" lb="Axis WS SOAP - OK" rc="200" rm="" tn="Check ThreadGroup 1-1" dt="text" de="text/xml; charset=utf-8">
  <assertionResult>
    <failure>false</failure>
    <error>false</error>
  </assertionResult>
  <responseData class="java.lang.String">Unsupported encoding in response data, can&apos;t record.</responseData>
  <samplerData class="java.lang.String">http://localhost//axis/services/Version
&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;
&lt;soapenv:Body&gt;
&lt;ns0:getVersion xmlns:ns0=&quot;http://axis.apache.org&quot; soapenv:encodingStyle=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot;/&gt;
&lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</samplerData>
</sample>
<httpSample t="78" lt="63" ts="1140420905823" s="true" lb="Soap/XML-RPC Sampler (Beta code)" rc="200" rm="OK" tn="Check ThreadGroup 1-1" dt="text" de="utf-8">
  <assertionResult>
    <failure>false</failure>
    <error>false</error>
  </assertionResult>
  <responseData class="java.lang.String">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;&lt;soapenv:Body&gt;&lt;ns1:getVersionResponse soapenv:encodingStyle=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot; xmlns:ns1=&quot;http://axis.apache.org&quot;&gt;&lt;getVersionReturn xsi:type=&quot;xsd:string&quot;&gt;Apache Axis version: 1.3
Built on Oct 05, 2005 (05:23:37 EDT)&lt;/getVersionReturn&gt;&lt;/ns1:getVersionResponse&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;</responseData>
  <cookies class="java.lang.String"></cookies>
  <method class="java.lang.String">POST</method>
  <queryString class="java.lang.String"></queryString>
  <url>http://localhost:8081/axis/services/Version</url>
</httpSample>
<sample t="32" lt="0" ts="1140420905855" s="false" lb="Axis WS SOAP - OK" rc="200" rm="" tn="Check ThreadGroup 1-1" dt="text" de="text/xml; charset=utf-8">
  <assertionResult>
    <failure>true</failure>
    <error>false</error>
    <failureMessage>Test failed, code expected to contain /500/</failureMessage>
  </assertionResult>
  <responseData class="java.lang.String">Unsupported encoding in response data, can&apos;t record.</responseData>
  <samplerData class="java.lang.String">http://localhost//axis/services/Version
&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;
&lt;soapenv:Body&gt;
&lt;ns0:getVersionn xmlns:ns0=&quot;http://axis.apache.org&quot; soapenv:encodingStyle=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot;/&gt;
&lt;/soapenv:Body&gt;
&lt;/soapenv:Envelope&gt;
</samplerData>
</sample>
<httpSample t="32" lt="32" ts="1140420905902" s="false" lb="Soap/XML-RPC Sampler (Beta code)" rc="500" rm="Internal server error" tn="Check ThreadGroup 1-1" dt="text" de="utf-8">
  <assertionResult>
    <failure>false</failure>
    <error>false</error>
  </assertionResult>
  <responseData class="java.lang.String">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;&lt;soapenv:Body&gt;&lt;soapenv:Fault&gt;&lt;faultcode xmlns:ns1=&quot;http://xml.apache.org/axis/&quot;&gt;ns1:Client&lt;/faultcode&gt;&lt;faultstring&gt;No such operation &apos;getVersionn&apos;&lt;/faultstring&gt;&lt;detail&gt;&lt;ns2:stackTrace xmlns:ns2=&quot;http://xml.apache.org/axis/&quot;&gt;No such operation &apos;getVersionn&apos;&#x0D;
	at org.apache.axis.providers.java.RPCProvider.getOperationDesc(RPCProvider.java:312)&#x0D;
	at org.apache.axis.providers.java.RPCProvider.processMessage(RPCProvider.java:88)&#x0D;
	at org.apache.axis.providers.java.JavaProvider.invoke(JavaProvider.java:323)&#x0D;
	at org.apache.axis.strategies.InvocationStrategy.visit(InvocationStrategy.java:32)&#x0D;
	at org.apache.axis.SimpleChain.doVisiting(SimpleChain.java:118)&#x0D;
	at org.apache.axis.SimpleChain.invoke(SimpleChain.java:83)&#x0D;
	at org.apache.axis.handlers.soap.SOAPService.invoke(SOAPService.java:453)&#x0D;
	at org.apache.axis.server.AxisServer.invoke(AxisServer.java:281)&#x0D;
	at org.apache.axis.transport.http.SimpleAxisWorker.execute(SimpleAxisWorker.java:428)&#x0D;
	at org.apache.axis.transport.http.SimpleAxisWorker.run(SimpleAxisWorker.java:155)&#x0D;
	at org.apache.axis.transport.http.SimpleAxisServer.run(SimpleAxisServer.java:245)&#x0D;
	at org.apache.axis.transport.http.SimpleAxisServer.start(SimpleAxisServer.java:296)&#x0D;
	at org.apache.axis.transport.http.SimpleAxisServer.start(SimpleAxisServer.java:304)&#x0D;
	at org.apache.axis.transport.http.SimpleAxisServer.main(SimpleAxisServer.java:385)&#x0D;
&lt;/ns2:stackTrace&gt;&lt;ns3:hostname xmlns:ns3=&quot;http://xml.apache.org/axis/&quot;&gt;w4de3csy0000184&lt;/ns3:hostname&gt;&lt;/detail&gt;&lt;/soapenv:Fault&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;</responseData>
  <cookies class="java.lang.String"></cookies>
  <method class="java.lang.String">POST</method>
  <queryString class="java.lang.String"></queryString>
  <url>http://localhost:8081/axis/services/Version</url>
</httpSample>

</testResults>
